Revit 2027 API
EnergyDataSettings.CheckBuildingConstructionClass Method
 Checks that the building construction class falls within an appropriate range.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static bool CheckBuildingConstructionClass(
	HVACLoadConstructionClass buildingConstructionClass
)
Public Shared Function CheckBuildingConstructionClass (
	buildingConstructionClass As HVACLoadConstructionClass
) As Boolean
public:
static bool CheckBuildingConstructionClass(
	HVACLoadConstructionClass buildingConstructionClass
)
static member CheckBuildingConstructionClass :
        buildingConstructionClass : HVACLoadConstructionClass -> bool
Parameters
buildingConstructionClass HVACLoadConstructionClass
 The building construction class to be checked.
Return Value
Boolean
 True if the building construction class falls within an appropriate range, false otherwise.
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  A value passed for an enumeration argument is not a member of that enumeration
See Also
Reference
EnergyDataSettings Class
Autodesk.Revit.DB.Analysis Namespace